
//получить начало диапазона
//получить конец диапазона
//поличить разницу часов в диапазоне
//разнести часы из диапазона в оъект

// - з 00:00 до 01:00, 04:00 до 07:00, 10:00 до 12:00, 16:00 до 18:00, 22:00 до 24:00 – черги будуть з електропостачанням
// - з 01:00 до 03:00, 07:00 до 09:00, з 12:00 до 16:00, з 18:00 до 21:00 - черги будуть вимкнені
// - з 03:00 до 04:00, 09:00 до 10:00, 21:00 до 22:00 – можливі вимкнення

// Підчерги 1.3, 1.4

// - з 03:00 до 06:00, 10:00 до 12:00, 16:00 до 18:00, 22:00 до 24:00 – черги будуть з електропостачанням
// - з 01:00 до 03:00, 07:00 до 10:00, з 13:00 до 16:00, з 19:00 до 22:00 – черги будуть вимкнені
// - з 00:00 до 01:00, 06:00 до 07:00, 12:00 до 13:00, з 18:00 до 19:00 - можливі вимкнення

// import * as chrono from './node_modules/chrono-node';

let blackout = [
    { hour: "00", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "01", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "02", q_1_1__1_2: 2, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "03", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 3, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "04", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "05", q_1_1__1_2: 3, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "06", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "07", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "08", q_1_1__1_2: 6, q_1_3__1_4: 1, q_2_1__2_2: 2, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 3, q_4_1: 1, q_4_2: 1,},
    { hour: "09", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "10", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "11", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "12", q_1_1__1_2: 2, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 2, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "13", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "14", q_1_1__1_2: 3, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "15", q_1_1__1_2: 1, q_1_3__1_4: 2, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "16", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "17", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "18", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 2, q_4_1: 1, q_4_2: 1,},
    { hour: "19", q_1_1__1_2: 2, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "20", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 3, q_4_2: 1,},
    { hour: "21", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 2, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "22", q_1_1__1_2: 1, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
    { hour: "23", q_1_1__1_2: 3, q_1_3__1_4: 1, q_2_1__2_2: 1, q_2_3__2_4: 1, q_3_1__3_2: 1, q_3_3__3_4: 1, q_4_1: 1, q_4_2: 1,},
];

const blackoutTable = document.querySelector(".blackout-table");
const startUpMarkup = `<li class="list-item item-heading">
                <div class="block hours-heading">Година черга</div>
                <div class="block">1.1 1.2</div>
                <div class="block">1.3 1.4</div>
                <div class="block">2.1 2.2</div>
                <div class="block">2.3 2.4</div>
                <div class="block">3.1 3.2</div>
                <div class="block">3.3 3.4</div>
                <div class="block">4.1</div>
                <div class="block">4.2</div>
            </li>`;

let markup = "";

function createMarkup() {
    blackoutTable.innerHTML = startUpMarkup;

    blackout.map((element) => {
        console.log(element);

        markup = `<li class="list-item item-clock">
            <div class="block hour hours-heading">${element.hour}</div>
            <div class="block ${blockColor(element.q_1_1__1_2)}></div>
            <div class="block ${blockColor(element.q_1_3__1_4)}></div>
            <div class="block ${blockColor(element.q_2_1__2_2)}></div>
            <div class="block ${blockColor(element.q_2_3__2_4)}></div>
            <div class="block ${blockColor(element.q_3_1__3_2)}></div>
            <div class="block ${blockColor(element.q_3_3__3_4)}></div>
            <div class="block ${blockColor(element.q_4_1)}></div>
            <div class="block ${blockColor(element.q_4_2)}></div>
            </li>`;

        blackoutTable.insertAdjacentHTML("beforeend", markup);

    })
}

function blockColor(color) {
    let markupStyle = "";
    switch (color) {
    case 1: markupStyle = `" style="background-color: #83ff2a;"`; break; //green
    case 2: markupStyle = `" style="background-color: #ff1212;"`; break; //red
    case 3: markupStyle = `" style="background-color: #f7ff0a;"`; break; //yellow
    default: markupStyle = `" style="background-color: #000000;"`; break; //black
    }
    return markupStyle;
}

createMarkup();

console.log(chrono.parseDate('An appointment on Sep 12-13'));